[
    {
        "Name": "Cornell CHRO Leadership Program",
        "Program Key": "cornell-chro",
        "Type": "Open",
        "Academic Partner Key": "Cornell",
        "B2B Account": "N/A",
        "Overview": "To shape the future of work and the organization of the future, today’s HR leaders and CHRO’s need to reimagine the basic tenets of Human Resource Management. To thrive in this ever-changing and complex ecosystem, HR leaders need a new set of skills and expertise. Cornell’s CHRO Leadership Program is designed to empower senior HR professionals to tackle the challenges of the new normal."
    },
    {
        "Name": "Cornell Senior Executive Leadership Program",
        "Program Key": "cornell-selp",
        "Type": "Open",
        "Academic Partner Key": "Cornell",
        "B2B Account": "N/A",
        "Overview": "Cornell Senior Executive Leadership Program (SELP) equips participants with the strategic foresight and innovative mindset essential for success through a unique blend of global experiential learning and tailored tracks. Our curriculum, meticulously crafted by world-class Cornell faculty, addresses the dynamic interplay of strategy, execution, innovation, sustainability and leadership in today’s context.\n\nAt the heart of Cornell SELP lies the opportunity for tailored tracks, catering to the diverse needs of executive roles such as CEO, CSO, CFO, CTO, COO, CMO, and CHRO. The bespoke approach ensures that participants not only deepen their expertise but also apply it directly to their respective domains, fostering impactful and transformative leadership. Participants must choose their track at the beginning of the program and follow a personalized learning path.\n\nFrom immersive in-class sessions held in New York and Dubai to dynamic online modules, the 10 months program offers a comprehensive learning experience.\n\nUpon completion, participants qualify for the prestigious Cornell Executive Alumni Status, unlocking a plethora of advantages. Become part of an elite cohort of global leaders committed to driving organizational success."
    },
    {
        "Name": "Cornell CXO Leadership Program",
        "Program Key": "cornell-cxo",
        "Type": "Open",
        "Academic Partner Key": "Cornell",
        "B2B Account": "N/A",
        "Overview": "Leadership in the new world requires a fresh set of skills that empower leaders and managers to face disruption head-on and lead in a world of increasing volatility and complexity. Cornell CXO Leadership Program (CXO) is designed to empower senior leaders to lead through these complex and uncertain times. You get access to the best of Ivy League education facilitated by award-winning faculty from Cornell University and global industry experts."
    },
    {
        "Name": "Cornell Chief AI Officer Program",
        "Program Key": "cornell-caio",
        "Type": "Open",
        "Academic Partner Key": "Cornell",
        "B2B Account": "N/A",
        "Overview": "AI in 2025 is way more than the ChatGPT of 2024. AI capabilities have rapidly advanced from text and visual generation in 2024, to doing advanced reasoning and autonomous agentic work in 2025. In effect, we already have widely accessible, limitless amounts of advanced intelligence.\n\nThese advances have the potential to usher in a business transformation akin to that from the invention of other general-purpose technologies such as the steam engine, electricity, the internet, etc. Organizations and individuals that prudently harness the potential of these technologies will gain a significant advantage, while those that get swept by the hype or fail to upskill and prepare risk obsolescence.\n\nThe Cornell Chief AI Officer Program prepares you to lead this AI transformation with clarity, confidence, and credibility. This experiential program with live interactive sessions, including working labs, builds fluency across the full stack of AI Transformation skills. You will select an organization or industry and apply insights from each session to create your AI Strategy Blueprint. In the final session, you’ll share your AI Strategy Blueprint with faculty for feedback and refinement."
    },
    {
        "Name": "Oxford Senior Executive Leadership Programme",
        "Program Key": "oxford-selp",
        "Type": "Open",
        "Academic Partner Key": "Oxford",
        "B2B Account": "N/A",
        "Overview": "Welcome to the Oxford Senior Executive Leadership Programme, Saïd Business School, University of Oxford’s leadership development programme for global senior leaders.\n\nIn today’s complex world, leaders face challenges from globalisation and innovative disruption to sustainability and the future of work. This programme helps senior leaders develop skills and mindsets to navigate these challenges, transforming them into opportunities.\n\nJoin us to learn how to drive sustainable, profitable growth and shareholder value in a turbulent geopolitical landscape. This nine-month journey provides tools and strategies to boost performance and impact at personal, professional and societal levels.\n\nThe Oxford Senior Executive Leadership Programme offers a framework for building flexible, adaptable and visionary leadership to seamlessly navigate change."
    },
    {
        "Name": "Michigan Ross CXO Leadership Program",
        "Program Key": "mr-cxo",
        "Type": "Open",
        "Academic Partner Key": "Michigan Ross",
        "B2B Account": "N/A",
        "Overview": "The business world is becoming increasingly complex as technological and social forces reshape how work is done, who does it, and who we do it for. Change is happening at an unprecedented pace, altering what leaders expect and what is expected of them.\n\nThe Michigan Ross CXO Leadership Program is intended to equip senior leaders to lead in today’s ever-evolving world. This six-month program explores multiple forces that are transforming the modern business landscape and workplaces with particular emphasis on innovation, and executing and leading through uncertainty. You will learn via live highly interactive online sessions from the renowned Michigan Ross faculty and experts.\n\nThrough this program, you will gain access to a top-ranked business school and research-backed actionable insights to deal with real business problems. You will examine trends, use case studies of emerging best practices, and discover applicable frameworks for your own business. You will experience an impact that extends far beyond the classroom to help you achieve your professional goals. Upon completion, you will receive a certificate from Michigan Ross Executive Education, to further solidify your commitment to excellence and leadership in the C-suite."
    }
]