[
    {
        "Profile Image": "https://cornell.chro.xedinstitute.org/wp-content/uploads/2024/09/rebecca_kehoe.jpg",
        "Name": "Rebecca Kehoe",
        "Title": "Associate Prof, Human Resource Studies",
        "Description": "Rebecca Kehoe is an Associate Professor of Human Resource Studies in the ILR School at Cornell University. She conducts research in the area of strategic human resource management, with an interest in better understanding how and when organizations achieve human resource-based competitive advantage. She holds a Ph.D., M.S., and B.S. from Cornell University. Prior to joining the faculty of the ILR School, she served on the faculty of Rutgers University. She has taught courses in Human Resource Management and Business Strategy.",
        "Academic Partner": "Cornell",
        "Faculty Code": "Professor (Tier 1)",
        "Preferred name": "Rebecca Kehoe",
        "Subject Area": "",
        "Note": ""
    },
    {
        "Profile Image": "https://cornell.chro.xedinstitute.org/wp-content/uploads/2024/09/bb92.jpg",
        "Name": "Bradford Bell",
        "Title": "William J. Conaty Professor of Strategic Human Resources",
        "Description": "Bradford S. Bell is the William J. Conaty Professor in Strategic Human Resources and Director of the Center for Advanced Human Resource Studies. He received his B.A. in Psychology from the University of Maryland at College Park and his M.A. and Ph.D. in Industrial and Organizational Psychology from Michigan State University. He worked in the management and organization development department of First USA Bank/Banc One and has worked as an HR consultant for multiple private and public firms. Dr. Bell is a fellow of the Society for Industrial and Organizational Psychology and American Psychological Association.",
        "Academic Partner": "Cornell",
        "Faculty Code": "Professor (Tier 1)",
        "Preferred name": "Bradford Bell",
        "Subject Area": "",
        "Note": ""
    },
    {
        "Profile Image": "https://cornell.chro.xedinstitute.org/wp-content/uploads/2024/09/Hausknecht.jpg",
        "Name": "John Hausknecht",
        "Title": "Professor, Human Resource Studies",
        "Description": "John Hausknecht is professor of human resource studies at Cornell University’s ILR School. His teaching, research, and consulting focuses on HR analytics and staffing-related topics including employee selection and turnover. Professor Hausknecht recently served as the academic director for Cornell’s ILR Executive Education and currently leads the HR analytics working group series for Cornell’s Center for Advanced HR Studies.",
        "Academic Partner": "Cornell",
        "Faculty Code": "Professor (Tier 1)",
        "Preferred name": "John Hausknecht",
        "Subject Area": "",
        "Note": ""
    },
    {
        "Profile Image": "https://cornell.chro.xedinstitute.org/wp-content/uploads/2024/09/Diane-Burton-0004RT-web.jpg",
        "Name": "M. Diane Burton",
        "Title": "Joseph R. Rich ’80 Professor, Human Resource Studies and Academic Director, Institute for Compensation Studies",
        "Description": "M. Diane Burton is a professor in the ILR School at Cornell University. Her primary appointment is in human resource studies with courtesy appointments in organizational behavior and sociology. Prior to joining the Cornell faculty in 2009, she was a faculty member at the MIT Sloan School of Management. She earned her Ph.D. in sociology at Stanford University and served as a lecturer and researcher in organizational behavior and human resources management at the Stanford Graduate School of Business. Hear from Adam Seth Litwin, Associate Professor",
        "Academic Partner": "Cornell",
        "Faculty Code": "Professor (Tier 1)",
        "Preferred name": "M. Diane Burton",
        "Subject Area": "",
        "Note": ""
    },
    {
        "Profile Image": "https://cornell.chro.xedinstitute.org/wp-content/uploads/2024/09/QtcEkgSqAeyZGEQceopO-768x992.png",
        "Name": "Tae Youn Park",
        "Title": "Associate Professor, Human Resource Studies",
        "Description": "Tae-Youn Park (Ph.D., University of Minnesota) is the Associate Professor of Human Resource Studies in the ILR School, Cornell University. His work has been published in many influential journals across disciplines. He currently serves on the editorial board of Academy of Management Journal, Personnel Psychology, and Compensation and Benefit Review. Before joining the ILR School, Tae-Youn was a Brownlee O. Currey Jr. Dean’s Faculty Fellow, assistant professor of Management in the Owen Graduate School of Management.",
        "Academic Partner": "Cornell",
        "Faculty Code": "Professor (Tier 1)",
        "Preferred name": "Tae Youn Park",
        "Subject Area": "",
        "Note": ""
    },
    {
        "Profile Image": "https://cornell.chro.xedinstitute.org/wp-content/uploads/2024/09/al2284.jpg",
        "Name": "Adam Seth Litwin",
        "Title": "Associate Professor",
        "Description": "Adam Seth Litwin is Associate Professor of Industrial and Labor Relations at Cornell’s ILR School and serves as an associate editor at its flagship journal, the ILR Review. Litwin has published a mix of empirical and conceptual studies intersecting the areas of labor relations and technological change, in both industrial relations and medical journals. Litwin joined Cornell’s ILR faculty in the fall of 2014 after serving as a standing faculty member at Johns Hopkins University, where he held appointments in the Carey Business School and the School of Medicine.",
        "Academic Partner": "Cornell",
        "Faculty Code": "Professor (Tier 1)",
        "Preferred name": "Adam Seth Litwin",
        "Subject Area": "",
        "Note": ""
    },
    {
        "Profile Image": "https://cornell.chro.xedinstitute.org/wp-content/uploads/2024/09/Ben-Rissing-Bio-2018.jpg",
        "Name": "Ben Rissing",
        "Title": "Associate Professor",
        "Description": "Ben A. Rissing studies employment-relevant decisions in organizations, including businesses, government, and academic institutions. He earned his doctorate in management from the Massachusetts Institute of Technology (MIT) Sloan School of Management; master’s degrees in management science and engineering management from MIT and Duke University, respectively; and a bachelor’s degree in mechanical engineering from the University of Virginia. Before joining Cornell University, Ben was the Hugh W. Pearson Visiting Professor of Commerce, Organizations and Entrepreneurship at Brown University.",
        "Academic Partner": "Cornell",
        "Faculty Code": "Professor (Tier 1)",
        "Preferred name": "Ben Rissing",
        "Subject Area": "",
        "Note": ""
    },
    {
        "Profile Image": "https://cornell.chro.xedinstitute.org/wp-content/uploads/2024/09/Lisa.jpg",
        "Name": "Lisa Csencsits",
        "Title": "Associate Director",
        "Description": "Lisa Csencsits, Associate Director for Executive Education at Cornell University, ILR, is responsible for the design, development and delivery of customized learning and capability development programs. Lisa holds a B.A. In Psychology from Adelphi University and a M.A. in Industrial/Organizational Psychology from Hofstra University. Ms. Csencsits, as an Organizational Development Practitioner, leverages her experience working with large privately and publicly held companies, as well as her research and educational expertise to provide programs grounded in theory with practical solutions to enhance participant learning and professional development.",
        "Academic Partner": "Cornell",
        "Faculty Code": "Professor (Tier 1)",
        "Preferred name": "Lisa Csencsits",
        "Subject Area": "",
        "Note": ""
    },
    {
        "Profile Image": "https://cornell.chro.xedinstitute.org/wp-content/uploads/2024/09/1518803336475.jpg",
        "Name": "Alwin Smith",
        "Title": "Adjunct Instructor",
        "Description": "Alvin specializes in Executive Development and Diversity Management. He is an Instructor at Cornell University, teaching Diversity & Inclusion. Alvin is a “storyteller” who provides a compelling first-hand account of the lessons he learned, and the experiences he endured during his career. He has a Bachelor of Science in Management from NYU Stern and a Marketing Management degree from Atlanta University Graduate School. He is also an American Management Association certified trainer.",
        "Academic Partner": "Cornell",
        "Faculty Code": "Professor (Tier 1)",
        "Preferred name": "Alwin Smith",
        "Subject Area": "",
        "Note": ""
    },
    {
        "Profile Image": "https://cornell.selp.xedinstitute.org/wp-content/uploads/2024/08/7.jpg",
        "Name": "Allan Filipowicz",
        "Title": "Clinical Professor of Management and Organisations",
        "Description": "Allan Filipowicz is a Clinical Professor of Management and Organizations at the Samuel Curtis Johnson Graduate School of Management at Cornell University. Professor Filipowicz received his Ph.D. from Harvard University. He holds an MBA from The Wharton School, an MA in International Affairs from the University of Pennsylvania, and degrees in electrical engineering (MEng, BS) and economics (BA) from Cornell University. His professional experience includes banking (Bankers Trust, New York) and consulting, including running his own boutique consulting firm and four years with The Boston Consulting Group in Paris.",
        "Academic Partner": "Cornell",
        "Faculty Code": "Professor (Tier 1)",
        "Preferred name": "Allan Filipowicz",
        "Subject Area": "",
        "Note": ""
    },
    {
        "Profile Image": "https://cornell.selp.xedinstitute.org/wp-content/uploads/2024/08/4.jpg",
        "Name": "Barbara Mink",
        "Title": "Senior Lecturer of Management Communication",
        "Description": "Barbara Mink is a management communication professional with a focus on intercultural communication, leadership, and persuasion. She teaches persuasive and informational writing for business purposes, as well as business presentations that are clear, concise, and compelling. Mink is also an active painter with an international presence.",
        "Academic Partner": "Cornell",
        "Faculty Code": "Professor (Tier 1)",
        "Preferred name": "Barbara Mink",
        "Subject Area": "",
        "Note": ""
    },
    {
        "Profile Image": "https://cornell.selp.xedinstitute.org/wp-content/uploads/2024/08/5.jpg",
        "Name": "Justin Johnson",
        "Title": "Professor of Management",
        "Description": "Professor Justin Johnson received his PhD in Economics from MIT and is currently the Deane W. Malott Professor of Management at the Johnson Graduate School of Management. Professor Johnson teaches Business Strategy to Executive MBA students. On four occasions he has received the EMBA Teaching Excellence Award, voted on by graduating EMBA students and awarded to one professor. In addition to his research, academic presentations, teaching, and executive development, Professor Johnson discusses his research and its relevance to current matters of interest with governmental bodies and other parties around the world, including the US Department of Justice, the US Federal Trade Commission, the EU Directorate General for Competition, the European Commission, and the UK Competition Authority.",
        "Academic Partner": "Cornell",
        "Faculty Code": "Professor (Tier 1)",
        "Preferred name": "Justin Johnson",
        "Subject Area": "",
        "Note": ""
    },
    {
        "Profile Image": "https://cornell.selp.xedinstitute.org/wp-content/uploads/2024/08/3.jpg",
        "Name": "Glen Dowell",
        "Title": "Professor of Management",
        "Description": "Glen Dowell is the Henrietta Johnson Louis Professor of Management and Associate Dean for Academic Affairs at the Johnson Graduate School of Management and Area Coordinator for the M&O Area at the SC Johnson College of Business. His researches are in the area of corporate sustainability, with a focus on firm environmental performance. He is a faculty affiliate for the Center for Sustainable Global Enterprise and is a faculty fellow at the Atkinson Center for a Sustainable Future.",
        "Academic Partner": "Cornell",
        "Faculty Code": "Professor (Tier 1)",
        "Preferred name": "Glen Dowell",
        "Subject Area": "",
        "Note": ""
    },
    {
        "Profile Image": "https://cornell.selp.xedinstitute.org/wp-content/uploads/2024/08/2.jpg",
        "Name": "Risa Mish",
        "Title": "Professor of Practice and Management",
        "Description": "Risa Mish designed and teaches the MBA, EMBA, and Cornell-Tsinghua Core courses in Critical and Strategic Thinking, teaches elective courses in critical thinking and leadership, and was the founding faculty director of the Johnson Leadership Fellows program. Risa Mish serves as a keynote speaker and workshop leader at global, national, and regional conferences for corporations and trade associations in the consumer products, financial services, health care, high tech, media, and manufacturing industries",
        "Academic Partner": "Cornell",
        "Faculty Code": "Professor (Tier 1)",
        "Preferred name": "Risa Mish",
        "Subject Area": "",
        "Note": ""
    },
    {
        "Profile Image": "https://cornell.selp.xedinstitute.org/wp-content/uploads/2024/08/1.jpg",
        "Name": "Derek Cabrerra",
        "Title": "Systems Scientist",
        "Description": "Derek Cabrera is an internationally known systems scientist who in 2021 was inducted as a Member of the International Academy for Systems and Cybernetic Sciences (IASCYS) for outstanding contributions to the field. He is the Faculty Director for the Graduate Certification Program in Systems Thinking, Modeling, and Leadership and is a senior scientist at Cabrera Research Lab. Cabrera has developed a suite of systems thinking tools for use in academia, business, and beyond including the first validated personal inventory of systems thinking.",
        "Academic Partner": "Cornell",
        "Faculty Code": "Professor (Tier 1)",
        "Preferred name": "Derek Cabrerra",
        "Subject Area": "",
        "Note": ""
    },
    {
        "Profile Image": "https://cornell.selp.xedinstitute.org/wp-content/uploads/2024/08/6.jpg",
        "Name": "Gautam Ahuja",
        "Title": "Professor of Management and Organisations",
        "Description": "Gautam Ahuja is a Professor of Management and Organizations at the Samuel Curtis Johnson Graduate School of Management at Cornell University. Ahuja teaches strategy and competitive analysis. In 2016, Ahuja received the BPS Wiley Outstanding Educator Award for his lifetime teaching contributions. At Cornell, he has received the Cornell-Tech Best Professor Award as well as the Johnson Graduate School of Management’s Apple Award. His research interests include competitive analysis, technology and innovation, globalization, and the use of inter-organizational arrangements.",
        "Academic Partner": "Cornell",
        "Faculty Code": "Professor (Tier 1)",
        "Preferred name": "Gautam Ahuja",
        "Subject Area": "",
        "Note": ""
    },
    {
        "Profile Image": "https://cornell.selp.xedinstitute.org/wp-content/uploads/2024/08/8.jpg",
        "Name": "Karan Girotra",
        "Title": "Professor of Operations Technology and Innovation",
        "Description": "Karan Girotra is a Professor of Operations, Technology and Innovation at Cornell-Tech and the Samuel Curtis Johnson Graduate School of Management in the Cornell SC Johnson College of Business. He is the academic lead for the flagship studio-based education programs at Cornell Tech and is applying his research on innovation to help build a new model for graduate education. Prior to joining Cornell Tech, Karan held the Paul Dubrule Chair at INSEAD, earned a doctorate at the Wharton School and a bachelors degree from the Indian Institute of Technology, Delhi.",
        "Academic Partner": "Cornell",
        "Faculty Code": "Professor (Tier 1)",
        "Preferred name": "Karan Girotra",
        "Subject Area": "",
        "Note": ""
    },
    {
        "Profile Image": "https://cornell.selp.xedinstitute.org/wp-content/uploads/2024/08/Anton-Musgrave.jpg.webp",
        "Name": "Anton Musgrave",
        "Title": "Futurist and Business Strategist",
        "Description": "Anton Musgrave lectures regularly for London Business School, Duke CE, IMD and Oxford’s Said Business School. He is passionate about teaching business strategy, innovation and the future. He has also served as Managing Partner of a large legal practice and Managing Director of a major property business. He shares an insightful understanding of the drivers of long-term business success, shifting business models and what it takes to stay ahead of the market.",
        "Academic Partner": "XED",
        "Faculty Code": "Professor (Tier 1)",
        "Preferred name": "Anton Musgrave",
        "Subject Area": "",
        "Note": ""
    },
    {
        "Profile Image": "https://cornell.selp.xedinstitute.org/wp-content/uploads/2024/08/Olivier-Tabatoni.jpg.webp",
        "Name": "Olivier Tabatoni",
        "Title": "Professor of Finance and Strategy",
        "Description": "Olivier Tabatoni is Associate Fellow at the Oxford University Saïd Business School. He was Visiting Professor at the Kellogg School of Management, Northwestern University and the Haas Business School, Berkeley. He regularly teaches in various universities and business schools in Europe including HEC Paris, Ecole Polytechnique or the Berlin School of Creative Leadership. Olivier Tabatoni received his Ph.D. in Finance from New York University’s Stern School of Management.",
        "Academic Partner": "XED",
        "Faculty Code": "Professor (Tier 1)",
        "Preferred name": "Olivier Tabatoni",
        "Subject Area": "",
        "Note": ""
    },
    {
        "Profile Image": "https://cornell.selp.xedinstitute.org/wp-content/uploads/2024/08/Mike-Grandinetti.jpg",
        "Name": "Mike Grandinetti",
        "Title": "Professor of Innovation",
        "Description": "Mike Grandinetti is Adjunct Professor, School of Engineering at Brown University. As a veteran Silicon Valley engineer and McKinsey consultant, Mike has been in the practice of innovation and entrepreneurship as an operating executive and educator. Mike serves as a faculty member at Harvard & Rutgers and has been affiliated with MIT in various capacities. Mike has been continuously active in the fields of innovation, entrepreneurship, human-centric design and digital marketing since earning his Bachelor of Science in Engineering degree. He went on to earn his MBA degree with distinction at Yale.",
        "Academic Partner": "XED",
        "Faculty Code": "Professor (Tier 1)",
        "Preferred name": "Mike Grandinetti",
        "Subject Area": "",
        "Note": ""
    },
    {
        "Profile Image": "https://cornell.cxo.xedinstitute.org/wp-content/uploads/2024/08/2-768x768.png",
        "Name": "Laura Chulak Georgianna",
        "Title": "Senior Lecturer, Management and Organizations",
        "Description": "Laura Chulak Georgianna is a distinguished leader in organizational development and executive education, currently serving as the Executive Director of Leadership Programs at Cornell University's Johnson Graduate School of Management. With extensive experience in developing leadership capabilities, Laura has designed and overseen a wide range of initiatives that enhance team effectiveness, resilience, and leadership growth. Her expertise spans across various industries, including global pharmaceuticals and IT services, where she has led transformative organizational changes and strategic cultural transitions. As a Senior Lecturer, Laura imparts practical leadership skills through experiential learning, including high-stakes expeditions and intensive coaching programs. Her robust background in organizational capability and development positions her as a trusted advisor and educator for senior executives seeking to elevate their leadership impact.",
        "Academic Partner": "Cornell",
        "Faculty Code": "Professor (Tier 1)",
        "Preferred name": "Laura Chulak Georgianna",
        "Subject Area": "",
        "Note": ""
    },
    {
        "Profile Image": "https://cornell.cxo.xedinstitute.org/wp-content/uploads/2024/08/3-768x768.png",
        "Name": "Neil Tarallo",
        "Title": "Senior Lecturer of Entrepreneurship",
        "Description": "Neil Tarallo is a senior lecturer of entrepreneurship at the Hotel School, SC Johnson College of Business. He previously served as the director of the Cornell University Entrepreneurship Bootcamp for Disabled Veterans. Neil has developed expertise in establishing culture, mindset, and structure for organizations that spurs market driven innovation & entrepreneurial activity. He teaches and have created a broad spectrum of entrepreneurship courses with significant experience developing academic innovation & entrepreneurship programs, including centers and institutes, dating back to 1994. He is also member of a venture capital partnership and an active angel investor.",
        "Academic Partner": "Cornell",
        "Faculty Code": "Professor (Tier 1)",
        "Preferred name": "Neil Tarallo",
        "Subject Area": "",
        "Note": ""
    },
    {
        "Profile Image": "https://cornell.cxo.xedinstitute.org/wp-content/uploads/2024/08/5-768x768.png",
        "Name": "General George Casey",
        "Title": "Senior Faculty of Leadership",
        "Description": "General George Casey is an accomplished soldier and an authority on strategic leadership. As the Army Chief of Staff, he led one of the nation's largest and most complex organizations during one of the most extraordinary periods in our history. Currently, he lectures internationally on leadership to the leaders of national and multinational corporations and at other business schools. He has broad international experience. Born in Japan, he served in operational assignments in Europe, the Balkans, and the Middle East.",
        "Academic Partner": "Cornell",
        "Faculty Code": "Professor (Tier 1)",
        "Preferred name": "General George Casey",
        "Subject Area": "",
        "Note": ""
    },
    {
        "Profile Image": "https://cornell.cxo.xedinstitute.org/wp-content/uploads/2024/08/4-768x768.png",
        "Name": "Tony Simons",
        "Title": "Professor of Innovation & Dynamic Management",
        "Description": "Tony Simons, the Louis B. Schaeneman Jr. Professor of Innovation & Dynamic Management, teaches organizational behavior, negotiation and leadership at the Cornell School of Hotel Administration. His research examines trust and credibility as relational, individual and collective qualities. Simons' research has focused on how well people are seen as keeping their word–delivering on their promises and living espoused values. His research and consulting work supports managers in meeting this challenge. He speaks, trains, consults, and designs surveys for organizations both within and beyond the hospitality industry.",
        "Academic Partner": "Cornell",
        "Faculty Code": "Professor (Tier 1)",
        "Preferred name": "Tony Simons",
        "Subject Area": "",
        "Note": ""
    },
    {
        "Profile Image": "https://cornell.cxo.xedinstitute.org/wp-content/uploads/2024/08/6-768x768.png",
        "Name": "Michelle Duguid",
        "Title": "Associate Dean of Diversity, Inclusion, and Belonging & Associate Professor of Management and Organisations",
        "Description": "Michelle M. Duguid is Associate Dean of Diversity, Inclusion, and Belonging and an associate professor of management and organizations at the Samuel Curtis Johnson Graduate School of Management at Cornell University. She received her MS and PhD in organizational behavior from Cornell University. She serves on the editorial board of Organization Science, the Academy of Management Journal, the Academy of Management Review, and Personnel Psychology.",
        "Academic Partner": "Cornell",
        "Faculty Code": "Professor (Tier 1)",
        "Preferred name": "Michelle Duguid",
        "Subject Area": "",
        "Note": ""
    },
    {
        "Profile Image": "https://cornell.cxo.xedinstitute.org/wp-content/uploads/2025/01/theomary_karamanis_tk626.jpg",
        "Name": "Theomary Karamanis",
        "Title": "Senior Lecturer of Marketing and Management Communications",
        "Description": "Theomary Karamanis is a multiple award-winning communication consultant and educator with 20 years of global experience. She is a senior faculty of Management Communication at the Cornell SC Johnson College of Business and regularly delivers executive workshops in strategic communication, crisis communication and leadership communication both in the US and internationally. Her academic background includes a PhD in communication studies, a Master of Arts in mass communication from Northwestern University, as well as a bachelor's degree in economics from the Athens University of Economics and Business.",
        "Academic Partner": "Cornell",
        "Faculty Code": "Professor (Tier 1)",
        "Preferred name": "Theomary Karamanis",
        "Subject Area": "",
        "Note": ""
    },
    {
        "Profile Image": "https://cornell.cxo.xedinstitute.org/wp-content/uploads/2025/01/pm388-pamela-moulton.jpg",
        "Name": "Pamela Moulton",
        "Title": "Professor of Finance",
        "Description": "Pamela Moulton is an Associate Professor of Finance at Cornell's School of Hotel Administration. Her teaching and research interests include financial markets and market microstructure, with a special interest in the role of investors. She earned her BS in economics at the Wharton School of the University of Pennsylvania and her Ph.D. in Finance and MPhil from the Columbia University Graduate School of Business. She was previously on the faculty of the Graduate School of Business Administration at Fordham University.",
        "Academic Partner": "Cornell",
        "Faculty Code": "Professor (Tier 1)",
        "Preferred name": "Pamela Moulton",
        "Subject Area": "",
        "Note": ""
    },
    {
        "Profile Image": "https://cornell.chiefaiofficer.xedinstitute.org/wp-content/uploads/2025/06/2024_1060_PN_002-e1730207993141-768x734.jpg",
        "Name": "Mor Namaan",
        "Title": "Professor at the Jacobs Technion-Cornell Institute",
        "Description": "Mor Naaman is Associate Dean for Faculty Affairs and Professor at the Jacobs Technion-Cornell Institute at Cornell Tech where he holds the Don and Mibs Follett Chair and in the Information Science Department at Cornell University, and currently serves as Associate Dean for Faculty Affairs (ADFA). Mor leads a research group looking at topics at the intersection of technology, media and democracy. The group applies multidisciplinary techniques - from machine learning to qualitative social science, to study our information ecosystem and its challenges, with a special focus on AI-mediated communication and its impact on society.",
        "Academic Partner": "Cornell",
        "Faculty Code": "Professor (Tier 1)",
        "Preferred name": "Mor Namaan",
        "Subject Area": "",
        "Note": ""
    },
    {
        "Profile Image": "https://cornell.chiefaiofficer.xedinstitute.org/wp-content/uploads/2025/06/profile-image-169618.jpeg",
        "Name": "David Rand",
        "Title": "Professor of Management Science and Brain and Cognitive Sciences",
        "Description": "David Rand is the Erwin H. Schell Professor and Professor of Management Science and Brain and Cognitive Sciences at MIT, the director of the Applied Cooperation Initiative, and an affiliate of the MIT Institute of Data, Systems, and Society, and the Initiative on the Digital Economy. David received his BA in computational biology from Cornell University in 2004 and his PhD in systems biology from Harvard University in 2009, was a post-doctoral researcher in Harvard University’s Department of Psychology from 2009 to 2013, and was an Assistant and then Associate Professor (with tenure) of Psychology, Economics, and Management at Yale University prior to joining the faculty at MIT.",
        "Academic Partner": "Cornell",
        "Faculty Code": "Professor (Tier 1)",
        "Preferred name": "David Rand",
        "Subject Area": "",
        "Note": ""
    },
    {
        "Profile Image": "https://cornell.chiefaiofficer.xedinstitute.org/wp-content/uploads/2025/06/2024_1060_AB_173-1-e1728576284309.jpg",
        "Name": "Frank Pasquale",
        "Title": "Professor of Law",
        "Description": "Frank Pasquale is Professor of Law at Cornell Tech and Cornell Law School. He is an expert on the law of artificial intelligence (AI), algorithms, and machine learning. His books include The Black Box Society (Harvard University Press, 2015) and New Laws of Robotics (Harvard University Press, 2020). He has published more than 70 journal articles and book chapters on topics ranging from technology policy to health law. He co-edited The Oxford Handbook on the Ethics of Artificial Intelligence (Oxford University Press, 2020) and Transparent Data Mining for Big and Small Data (Springer-Verlag, 2017).",
        "Academic Partner": "Cornell",
        "Faculty Code": "Professor (Tier 1)",
        "Preferred name": "Frank Pasquale",
        "Subject Area": "",
        "Note": ""
    },
    {
        "Profile Image": "https://cornell.chiefaiofficer.xedinstitute.org/wp-content/uploads/2025/06/Navid-Asgari-2024.jpg",
        "Name": "Navid Asgar",
        "Title": "Professor of Management Systems",
        "Description": "Dr. Navid Asgari is an Associate Professor and Grose Family Endowed Chair in Business Strategy and Statistics at Fordham University’s Gabelli School of Business. He specializes in competitive strategy, innovation, and the integration of design thinking into corporate strategy. His research focuses on helping organizations navigate complexity, adapt to technological changes, and foster innovation. He emphasizes strategic decision-making in dynamic environments and works at the intersection of strategy and design thinking to help firms stay competitive.",
        "Academic Partner": "XED",
        "Faculty Code": "Professor (Tier 1)",
        "Preferred name": "Navid Asgar",
        "Subject Area": "",
        "Note": ""
    },
    {
        "Profile Image": "https://cornell.chiefaiofficer.xedinstitute.org/wp-content/uploads/2025/06/AntoinetteD-H2022-2452-768x512.jpg",
        "Name": "Antoinette Dale Henderson",
        "Title": "Leadership and Change Expert and Executive Coach",
        "Description": "Antoinette Dale Henderson is an internationally recognized expert in leadership communications with over 25 years of experience. She has held senior roles at leading PR consultancies and is the founder of the Gravitas® Programme, which equips women leaders with the skills to communicate effectively and command respect. Antoinette’s methodology emphasizes the importance of gravitas in leadership, a quality that empowers leaders to inspire, influence, and navigate change successfully.\n\nThrough her work with global organizations such as Google, PwC, Siemens, and Johnson & Johnson, Antoinette has delivered transformative leadership programs that help individuals step into senior roles with confidence and impact. Her expertise lies in helping leaders articulate a clear vision, build trust, and foster a culture of inclusion and engagement. She has also worked extensively with government bodies, including the Cabinet Office and HMRC, enhancing the leadership capabilities of public sector leaders.\n\nIn addition to her corporate work, Antoinette is the author of two acclaimed books, Leading with Gravitas and Power Up, and a popular TEDx speaker. Her contributions to leadership development have made her a sought-after keynote speaker and coach, especially for those aiming to strengthen their presence and influence in challenging environments.",
        "Academic Partner": "XED",
        "Faculty Code": "Professor (Tier 1)",
        "Preferred name": "Antoinette Dale Henderson",
        "Subject Area": "",
        "Note": ""
    },
    {
        "Profile Image": "https://cornell.chiefaiofficer.xedinstitute.org/wp-content/uploads/2025/06/Jamie-Anderson.webp",
        "Name": "Jamie Anderson",
        "Title": "Creative Management Thinker",
        "Description": "Jamie has held teaching positions at some of the world’s top business schools, such as London Business School, IMD, ESMT Berlin and the University of Melbourne. Named as a “management guru” by the Financial Times, Jamie has also been listed as one of the world’s top 25 management thinkers by the journal Business Strategy Review. He is passionate about teaching strategy, innovation and creativity.",
        "Academic Partner": "XED",
        "Faculty Code": "Professor (Tier 1)",
        "Preferred name": "Jamie Anderson",
        "Subject Area": "",
        "Note": ""
    },
    {
        "Profile Image": "https://cornell.chiefaiofficer.xedinstitute.org/wp-content/uploads/2025/06/Faculty-Profile.pptx-e1741684832338-1-768x802.png",
        "Name": "Federico Quijada",
        "Title": "Professor of Technology",
        "Description": "Fred Quijada’s has lectured in professional education programs on technology management and information science for the Massachusetts Institute of Technology for the past 3 years. His current research centers on creating a unified theory for technology leadership, while also exploring the applications of AI/ML, cloud computing, and DevOps technologies within enterprise settings. He holds an A.B., Cum Laude, from St. Anselm College, a J.D. specializing in corporate law from Villanova University, an Sc.M. in Technology Leadership from Brown University, and is currently pursuing an M.L.A. in Ethics & Leadership from the University of Chicago and Doctor of Technology from Purdue University.",
        "Academic Partner": "XED",
        "Faculty Code": "Professor (Tier 1)",
        "Preferred name": "Federico Quijada",
        "Subject Area": "",
        "Note": ""
    },
    {
        "Profile Image": "https://michiganross.cxo.xedinstitute.org/wp-content/uploads/2024/10/6.jpg",
        "Name": "Horst Abraham",
        "Title": "Executive Education Faculty",
        "Description": "No Description",
        "Academic Partner": "Michigan Ross",
        "Faculty Code": "Professor (Tier 1)",
        "Preferred name": "Horst Abraham",
        "Subject Area": "",
        "Note": ""
    },
    {
        "Profile Image": "https://michiganross.cxo.xedinstitute.org/wp-content/uploads/2024/10/5.jpg",
        "Name": "Lindy Greer",
        "Title": "Professor for Management and Organizations; Michael R. and Mary Kay Hallman Fellow",
        "Description": "No Description",
        "Academic Partner": "Michigan Ross",
        "Faculty Code": "Professor (Tier 1)",
        "Preferred name": "Lindy Greer",
        "Subject Area": "",
        "Note": ""
    },
    {
        "Profile Image": "https://michiganross.cxo.xedinstitute.org/wp-content/uploads/2024/10/4.jpg",
        "Name": "Brad Killaly",
        "Title": "Clinical Associate Professor of Strategy",
        "Description": "No Description",
        "Academic Partner": "Michigan Ross",
        "Faculty Code": "Professor (Tier 1)",
        "Preferred name": "Brad Killaly",
        "Subject Area": "",
        "Note": ""
    },
    {
        "Profile Image": "https://michiganross.cxo.xedinstitute.org/wp-content/uploads/2024/10/9.jpg",
        "Name": "Dave Mayer",
        "Title": "John H. Mitchell Professor in Business Ethics; Professor of Management and Organizations; Chair of Management and Organizations",
        "Description": "No Description",
        "Academic Partner": "Michigan Ross",
        "Faculty Code": "Professor (Tier 1)",
        "Preferred name": "Dave Mayer",
        "Subject Area": "",
        "Note": ""
    },
    {
        "Profile Image": "https://michiganross.cxo.xedinstitute.org/wp-content/uploads/2024/10/8.png",
        "Name": "Nigel Melville",
        "Title": "Associate Professor of Technology and Operations",
        "Description": "No Description",
        "Academic Partner": "Michigan Ross",
        "Faculty Code": "Professor (Tier 1)",
        "Preferred name": "Nigel Melville",
        "Subject Area": "",
        "Note": ""
    },
    {
        "Profile Image": "https://michiganross.cxo.xedinstitute.org/wp-content/uploads/2024/10/7.jpg",
        "Name": "Jagadeesh Sividasan",
        "Title": "Buzz and Judy Newton Professor of Business Administration; Area Chair and Professor of Business Economics and Public Policy",
        "Description": "No Description",
        "Academic Partner": "Michigan Ross",
        "Faculty Code": "Professor (Tier 1)",
        "Preferred name": "Jagadeesh Sividasan",
        "Subject Area": "",
        "Note": ""
    },
    {
        "Profile Image": "https://michiganross.cxo.xedinstitute.org/wp-content/uploads/2024/10/12.jpg",
        "Name": "Gretchen Spreitzer",
        "Title": "Associate Dean for Executive and Corporate Relations; Keith E. and Valerie J. Alessi Professor of Business Administration; Professor of Management and Organizations",
        "Description": "No Description",
        "Academic Partner": "Michigan Ross",
        "Faculty Code": "Professor (Tier 1)",
        "Preferred name": "Gretchen Spreitzer",
        "Subject Area": "",
        "Note": ""
    },
    {
        "Profile Image": "https://michiganross.cxo.xedinstitute.org/wp-content/uploads/2024/10/11.jpg",
        "Name": "S. Sriram",
        "Title": "Associate Dean for Graduate Programs; Dwight F. Benton Professor of Marketing; Michael R. and Mary Kay Hallman Faculty Fellow",
        "Description": "No Description",
        "Academic Partner": "Michigan Ross",
        "Faculty Code": "Professor (Tier 1)",
        "Preferred name": "S. Sriram",
        "Subject Area": "",
        "Note": ""
    },
    {
        "Profile Image": "https://michiganross.cxo.xedinstitute.org/wp-content/uploads/2024/10/10.jpg",
        "Name": "Maxim Sytch",
        "Title": "Jack D. Sparks Whirlpool Corporation Research Professor of Business Administration; Professor of Management and Organizations; Management and Organizations Faculty Doctoral Coordinator",
        "Description": "No Description",
        "Academic Partner": "Michigan Ross",
        "Faculty Code": "Professor (Tier 1)",
        "Preferred name": "Maxim Sytch",
        "Subject Area": "",
        "Note": ""
    },
    {
        "Profile Image": "https://michiganross.cxo.xedinstitute.org/wp-content/uploads/2024/12/1516253894205.jpg",
        "Name": "Dr. Ariff Kachra",
        "Title": "No Title",
        "Description": "No Description",
        "Academic Partner": "XED",
        "Faculty Code": "Professor (Tier 1)",
        "Preferred name": "Dr. Ariff Kachra",
        "Subject Area": "",
        "Note": ""
    },
    {
        "Profile Image": "https://oxford.selp.xedinstitute.org/wp-content/uploads/2024/07/Paul-Fisher.webp",
        "Name": "Paul Fisher",
        "Title": "Programme Director, Oxford Senior Executive Leadership Programme",
        "Description": "Paul Fisher is Programme Director of the Oxford Programme on Negotiation (OPN) which he has helped to design and develop since its inception in 2004. Paul also teaches on OPN and other programmes with topics including preparation in negotiations, decision-making, persuasion, stakeholder management, managing emotions, multi-party & multi-issue negotiations and virtual negotiations. Paul has co-written a number of negotiation simulations, including one on the building of a football stadium and the other designed specifically for virtual negotiations. Paul has over 20 years’ experience in the field of communications, education and capacity building, helping private and public sector organisations to achieve their full potential.",
        "Academic Partner": "Oxford",
        "Faculty Code": "Professor (Tier 1)",
        "Preferred name": "Paul Fisher",
        "Subject Area": "",
        "Note": ""
    },
    {
        "Profile Image": "https://oxford.selp.xedinstitute.org/wp-content/uploads/2024/12/Allyson-Stewart-Allen-768x768.webp",
        "Name": "Allyson Stewart-Allen",
        "Title": "Associate Fellow",
        "Description": "Allyson Stewart-Allen is an award-winning educator, advisor, author, speaker and non-executive director whose expertise in leadership development and brand internationalisation are sought by global businesses.\n\nShe has advised more than 260 businesses across 27 countries including Accenture, Aegis, BAE Systems, Burberry, HSBC, Lufthansa, Meltwater, NBC Universal, SAB Miller and Shell. She also recently served as a board member of the Chartered Institute of Marketing.\n\nAllyson is included in The Female FTSE Report 2014: 100 Women to Watch list (Cranfield International Centre for Women Leaders), Who’s Who in the World, Who’s Who in America and Who’s Who Among Women.\n\nAn experienced and frequent broadcaster, she lends her insights to television and print media outlets across the globe. Besides her four-year slot for Sky News as The Muse of Marketing, Allyson has appeared on several television shows, including five series of BBC’s The Apprentice and CNBC’s The Business Class. Other outlets regularly applying her insights include BBC, CNN, Deutsche Welle, Fortune, France 24, FT and The Wall Street Journal.\n\nAs well as creating the new LinkedIn Learning course Leading International Growth, Allyson is a frequent keynote speaker on the topic at international conferences including the Global Peter Drucker Forum, the Conference Board and the FT’s Board Development Programme and Women in Business Forum. She serves as a Judge for the Management Today Business Awards, CIM Marketing Excellence Awards and the British Business Excellence Awards on whose advisory board she sits.\n\nAllyson is a mentor for female leaders in a variety of settings ranging from tech start-ups to big pharma and is one of the original mentors for the Mayor of London International Business Programme cohorts as well as senior female leaders in well-known global law firms, big pharma and manufacturing businesses.\nA Californian based in Europe for over 30 years, Allyson applies her extensive international consulting experience, MBA education with Dr Peter Drucker and languages (French, German) to the advisory company she founded, International Marketing Partners.\n\nAllyson is the first-ever two-time winner of the EFMD (European Foundation for Management Development) Excellence in Practice Award recognising the leadership programmes she conceived and delivered for Lufthansa (London Business School, 2009) and BAE Systems (Saïd Business School, University of Oxford, 2012).",
        "Academic Partner": "Oxford",
        "Faculty Code": "Professor (Tier 1)",
        "Preferred name": "Allyson Stewart-Allen",
        "Subject Area": "",
        "Note": ""
    },
    {
        "Profile Image": "https://oxford.selp.xedinstitute.org/wp-content/uploads/2024/12/Charlie-Curtis-2019-square-768x768.webp",
        "Name": "Charlie Curtis",
        "Title": "Associate Fellow and Entrepreneurship Expert",
        "Description": "Charlie is a corporate innovation adviser.\nSince the late 1990s, he has designed and led corporate innovation programmes and worked with hundreds of intrapreneurs and entrepreneurs in the UK, USA, India, Africa and Australia. He specialises in delivering impact-led corporate innovation: how to create and sustain new offers within a big business environment; as well as leadership for innovation: how to create a culture that supports both creativity and implementation; and finally organisation: how to build the optimal operating model and support functions for innovation.\n\nAs an entrepreneur is his own right, he is co-founder of two University of Oxford deep-tech spin-outs: DryGro grows crops using 99% less water; Origen Power technologies to remove CO2 from the air.\n\nCharlie is an entrepreneurship expert and a member of the Entrepreneurship Centre’s oNetwork. He also sits on the UBS Young Academy Investment Committee, which invests in impact-led education ventures and is a steering group member for Yunus Social Business.\n\nCharlie has a Master’s in Engineering Science from the University of Oxford.",
        "Academic Partner": "Oxford",
        "Faculty Code": "Professor (Tier 1)",
        "Preferred name": "Charlie Curtis",
        "Subject Area": "",
        "Note": ""
    },
    {
        "Profile Image": "https://oxford.selp.xedinstitute.org/wp-content/uploads/2024/12/Carissa-Veliz-colour-e1733141045247-768x919.jpg",
        "Name": "Carissa Veliz",
        "Title": "Associate Professor in Philosophy",
        "Description": "Carissa is an Associate Professor at the Faculty of Philosophy and the Institute for Ethics in AI, and a Tutorial Fellow in Philosophy at Hertford College.\n\nCarissa completed her DPhil in Philosophy at the University of Oxford. She was then a Research Fellow at the Uehiro Centre for Practical Ethics and the Wellcome Centre for Ethics and Humanities at the University of Oxford.",
        "Academic Partner": "Oxford",
        "Faculty Code": "Professor (Tier 1)",
        "Preferred name": "Carissa Veliz",
        "Subject Area": "",
        "Note": ""
    },
    {
        "Profile Image": "https://oxford.selp.xedinstitute.org/wp-content/uploads/2024/12/John-Denton-768x768.webp",
        "Name": "John Denton",
        "Title": "Associate Fellow",
        "Description": "John specialises in supporting the implementation of strategic change and developing leadership capability.\nAs an Associate Fellow, he has designed, directed and supported many executive education programmes for major clients, including Bank of China, European Patent Office, Oman Aviation Group, Rolls-Royce, Royal Mail Group, SABMiller, Arcadis, BAE Systems, MAN, China Construction Bank, Commerzbank, CNOOC-Nexen and several governments in the Middle East and Southeast Asia.\n\nHe is passionate about helping people to find creative solutions to tough problems and identifying fresh ways to implement them. He uses a range of approaches, including well-proven psychometric profiling instruments to provide clients with a more informed and deeper understanding of how to develop their personal style to increase their effectiveness as leaders.\n\nPreviously, John worked as a manager for the UK’s air traffic service, NATS. A career initially in engineering was followed by a series of strategic corporate roles in investment planning and implementing organisational change.\n\nJohn has an MBA from Henley (University of Reading), is an Incorporated Engineer (IEng), a Member of the Institution of Engineering and Technology (MIET), a Chartered Manager (CMgr), a Fellow of the Chartered Management Institute (FCMI), BPS Levels A&B qualified and a Member of the Association of Coaching (MAC).",
        "Academic Partner": "Oxford",
        "Faculty Code": "Professor (Tier 1)",
        "Preferred name": "John Denton",
        "Subject Area": "",
        "Note": ""
    },
    {
        "Profile Image": "https://oxford.selp.xedinstitute.org/wp-content/uploads/2024/12/Trang-Chu-June-2023-sq-768x768.webp",
        "Name": "Trang Chu",
        "Title": "Associate Fellow",
        "Description": "Trang is an Associate Fellow at Saïd Business School, University of Oxford, and lectures on leadership agility, emotions, heuristics and decision-making.\n\nShe draws on the latest research in affective and decision science to help senior executives and public leaders leverage their emotions to build trust, promote inclusive leadership, and achieve superior decision-making performance, enabling them to successfully lead and expand their businesses.\n\nBefore her academic career, Trang spent 25 years in capital markets, gaining valuable insights into the role of emotions in risk decision-making. She was Managing Director and Head of Global Capital Markets, AWM at Deutsche Bank and Managing Director and Head of the Financial Products Group, EMEA, at Merrill Lynch, leading a global cross-functional trading, originating, and structuring team. Previously, she was at Salomon Smith Barney in equity derivatives trading and structuring and project finance at Lehman Brothers.\n\nTrang is currently pursuing her doctorate at University College London, Faculty of Brain Sciences. Her research explores the relationship between language and emotions and how language can influence emotional and behavioural responses. She earned an MSc in Cognitive and Decision Science from University College London, investigating the role of language and emotions in decision-making. Her research shed light on the complex interplay between these key elements, providing insightful perspectives into human behaviour and decision-making processes. Additionally, Trang studied research and experimental design in cognitive neuroscience in a joint programme between The International Max Planck Research School on Neuroscience of Communication: Function, Structure, and Plasticity and the Institute of Cognitive Neuroscience UCL.\n\nHer other degrees include an MBA in Finance and Economics from the University of Chicago and a BSc in Economics from New York University Stern School of Business.",
        "Academic Partner": "Oxford",
        "Faculty Code": "Professor (Tier 1)",
        "Preferred name": "Trang Chu",
        "Subject Area": "",
        "Note": ""
    },
    {
        "Profile Image": "https://oxford.selp.xedinstitute.org/wp-content/uploads/2024/12/Nelisha_Wickremasinghe-768x768.webp",
        "Name": "Nelisha Wickremasinghe",
        "Title": "Leadership and Change Consultant",
        "Description": "Nelisha Wickremasinghe is a chartered psychologist, author, educator and international leadership/organisational change consultant. She has worked in the field of human development for over 30 years. Nelisha has postgraduate degrees in psychology and family therapy, a master’s in public sector management and a doctorate in organisational change. Nelisha works internationally with large corporates, teaching and consulting on healthy growth. In addition to her role at Saïd Business School, she is also an associate at the Ashridge Hult Business School and founding director/lead practitioner at The Dialogue Space, which provides therapeutic depth development for individuals, families and employees within organisations.",
        "Academic Partner": "Oxford",
        "Faculty Code": "Professor (Tier 1)",
        "Preferred name": "Nelisha Wickremasinghe",
        "Subject Area": "",
        "Note": ""
    },
    {
        "Profile Image": "https://oxford.selp.xedinstitute.org/wp-content/uploads/2024/12/michael-smets-1-768x768.webp",
        "Name": "Michael Smets",
        "Title": "Professor of Management",
        "Description": "Michael Smets regularly speaks at academic and practitioner conferences and delivers executive education programmes for leading companies in the legal, consulting, reinsurance and healthcare sectors. His research is published in leading academic journals, academic and professional handbooks and has been featured in the national and professional press. Michael obtained the equivalent of a BA in Business and Economics from Cologne University in Germany before joining Saïd Business School for his postgraduate education. There he obtained an MSc in Management Research and a DPhil in Management before accepting a post-doc position jointly held by Saïd Business School and the School of Management at the University of Alberta, Canada.",
        "Academic Partner": "Oxford",
        "Faculty Code": "Professor (Tier 1)",
        "Preferred name": "Michael Smets",
        "Subject Area": "",
        "Note": ""
    },
    {
        "Profile Image": "https://oxford.selp.xedinstitute.org/wp-content/uploads/2024/12/Peter_Hanke-768x768.webp",
        "Name": "Peter Hanke",
        "Title": "Associate Fellow",
        "Description": "Peter Hanke is a conductor of classical music and an associate of the Centre for Art and Leadership at the Copenhagen Business School. An experienced classical music conductor and performer, Peter investigates the connections between leadership and music, philosophy and performance theory. Since 2003 Peter has delivered numerous experiential learning sessions on conducting leadership at Saïd Business School, University of Oxford. He holds a BA in Musicology from the University of Copenhagen and an MA in Conducting from the Royal Danish Academy of Music. He received the Einar Hansens Research Award in 2005.",
        "Academic Partner": "Oxford",
        "Faculty Code": "Professor (Tier 1)",
        "Preferred name": "Peter Hanke",
        "Subject Area": "",
        "Note": ""
    },
    {
        "Profile Image": "https://oxford.selp.xedinstitute.org/wp-content/uploads/2024/12/abrar-chaudhury-768x768.webp",
        "Name": "Abrar Choudhury",
        "Title": "Senior Research Fellow",
        "Description": "Abrar conducts research on topics of global environmental change, climate finance and corporate purpose.\n\nHe is affiliated with Oxford’s Environmental Change Institute (ECI) and is a Fellow of Green Templeton College.\n\nAbrar is currently on a prestigious three-year British Academy Fellowship at Oxford, investigating the ways in which dedicated climate funding, such as the Green Climate Fund, and emerging technologies, such as artificial intelligence and distributed ledgers, shape implementation and diffusion of climate action in Pakistan and emerging economies.\n\nHe was on the core research team for a pioneering Oxford collaboration with EY Global, to understand how and why C-Suite and Boards from large global MNCs are again focused on corporate ‘purpose’ in a turbulent global economy. The findings contribute to a global research initiative on corporate transformation to meet the challenges of the early 21st century.\n\nAbrar is the recipient of the ‘Best Dissertation’ award (2017) from the Academy of Management, Organisations and the Natural Environment (ONE) Division. He publishes widely in leading academic journals and presents at global and speciality conferences in management and strategy, innovation, climate change policy and practice, and environmental sustainability.\nAbrar earned a doctorate in Environmental Change and Management, an MBA and an MSc in Environmental Management (Distinction), all from the University of Oxford. He is a Fellow Chartered Accountant (FCA). His doctoral research explored the organisational and network challenges of implementation to develop and deliver climate change adaptation policy in emerging economies, based on extensive fieldwork in Ghana, Nepal, and Pakistan.\n\nPrior to Oxford, Abrar was a partner in a leading accounting firm in Pakistan.",
        "Academic Partner": "Oxford",
        "Faculty Code": "Professor (Tier 1)",
        "Preferred name": "Abrar Choudhury",
        "Subject Area": "",
        "Note": ""
    },
    {
        "Profile Image": "https://oxford.selp.xedinstitute.org/wp-content/uploads/2024/12/Dopson-Sue-original-768x768.webp",
        "Name": "Sue Dopson",
        "Title": "Professor of Organisational Behaviour",
        "Description": "Sue Dopson has a BSc in Sociology, MSc in Sociology with special reference to medicine, MA (Oxon) and a PhD studying the introduction of general management into the NHS. She is a fellow of the academy of Social Sciences. Dopson conducts research in a range of public and private sector organisations. Her research lies in the area of innovation, change and healthcare studies. She has led a number of research projects in public and private sector organisations.",
        "Academic Partner": "Oxford",
        "Faculty Code": "Professor (Tier 1)",
        "Preferred name": "Sue Dopson",
        "Subject Area": "",
        "Note": ""
    },
    {
        "Profile Image": "https://oxford.selp.xedinstitute.org/wp-content/uploads/2024/12/4354-417179_Owen_Darbishire_0-768x768.webp",
        "Name": "Owen Darbshire",
        "Title": "Associate Professor in Organisational Behaviour",
        "Description": "Owen Darbishire is the Rhodes Trust Associate Professor in Management Studies (Organisational Behaviour and Industrial Relations) at Saïd Business School and Sue Cormack Fellow at Pembroke College, University of Oxford.\n\nOwen is known internationally for his research examining how comparative employment systems and work organisation have been evolving, as well as exploring the causes and consequences of changes in the institutional regulation of labour markets across a range of national economies. These include Britain, Germany, Australia, the United States and other countries. In addition, his research explores how varieties of capitalism impact firm performance, the comparative functioning of labour markets, the political economy of changes in labour and employment law, and the impact of new technology on work. A further strand of research explores negotiations in a national and international context. In addition to many articles and book chapters, he is the author (with Harry Katz) of the book ‘Converging Divergences: Worldwide changes in employment systems,’ Cornell University Press, 2000.\n\nOwen is Director of the Oxford Transition to Leadership Programme, a general management programme for mid-career managers, and through his teaching he also works with undergraduate and postgraduate students through to the most senior leaders of major organisations. His teaching focuses on individual, group and organisational decision making and he is also an experienced teacher of negotiation for senior executives.\n\nAn elected member of Saïd Business School Board and former Chair of the Faculty, which he joined in 1996, Owen is also a member of the Governing Body of Pembroke College. For the business school he has been Director of Undergraduate Degrees, Director of the Oxford Advanced Management Programme and Director of the Programme on Chinese Entrepreneurial Development.\n\nOwen has a degree in Politics, Philosophy and Economics from the University of Oxford where he was an Exhibitioner at Balliol College. He took his MSc and PhD in Collective Bargaining from the School of Industrial and Labour Relations at Cornell University, USA, where he was also later the Brettschneider Scholar in 2008. Visiting appointments include research fellowships in Germany at IAAG, Trier, and the Max-Planck-Institut, Cologne.",
        "Academic Partner": "Oxford",
        "Faculty Code": "Professor (Tier 1)",
        "Preferred name": "Owen Darbshire",
        "Subject Area": "",
        "Note": ""
    },
    {
        "Profile Image": "https://oxford.selp.xedinstitute.org/wp-content/uploads/2024/07/Trudi-Lang.webp",
        "Name": "Trudi Lang",
        "Title": "Senior Fellow in Management Practice",
        "Description": "As a practice faculty, Trudi Lang works with executives to support them in the achievement of their strategic objectives. Her research, executive education and consulting focuses on strategising in dynamic environments. In addition to holding a PhD (DPhil, Management Studies) from the University of Oxford, Trudi has an MSc degree in Management Research from Oxford, graduating with Distinction and winning the Templeton College Nautilus Award for Outstanding Academic Achievement. She also holds an MBA (Executive) (Distinction) from Curtin University, Australia, and an MA (Political Science) from the University of Hawaii, USA. She is a member of the Strategic Management Society and the Academy of Management.",
        "Academic Partner": "Oxford",
        "Faculty Code": "Professor (Tier 1)",
        "Preferred name": "Trudi Lang",
        "Subject Area": "",
        "Note": ""
    },
    {
        "Profile Image": "https://oxford.selp.xedinstitute.org/wp-content/uploads/2024/07/Joel-Shapiro.webp",
        "Name": "Joel Shapiro",
        "Title": "Professor of Financial Economics",
        "Description": "Joel Shapiro’s main area of expertise is the regulation and governance of financial institutions. Joel has conducted research on credit ratings, banking regulation, corporate governance, executive compensation, LIBOR, ESG and conflicts of interest in retail finance. He is published in top international journals such as the Journal of Finance, Journal of Financial Economics and the Review of Financial Studies. Prior to joining Saïd Business School, Joel was a tenured associate professor at Universitat Pompeu Fabra in Barcelona. He received his PhD in Economics in 2000 from Princeton University. He has been a visiting lecturer for the University of Wisconsin-Madison and the New York University Stern School of Business as well as visiting researcher for the Federal Reserve Bank of New York. Joel is also an Associate Editor at the Journal of Corporate Finance.",
        "Academic Partner": "Oxford",
        "Faculty Code": "Professor (Tier 1)",
        "Preferred name": "Joel Shapiro",
        "Subject Area": "",
        "Note": ""
    },
    {
        "Profile Image": "https://oxford.selp.xedinstitute.org/wp-content/uploads/2024/07/Andrew-Stephen.webp",
        "Name": "Andrew Stephen",
        "Title": "Professor of Marketing",
        "Description": "Andrew Stephen is one of the world’s leading academic marketing experts. At Oxford Saïd, Andrew is Associate Dean of Research, responsible for all academic matters at the School. As L’Oréal Professor of Marketing, he is the University’s most-senior marketing academic and leads the School’s group of marketing faculty members and research staff, as well as serving as the director of the Oxford Future of Marketing Initiative. Andrew is one of the world’s top marketing academics and is a leading voice on the future of the marketing, media and advertising industries. His research and industry engagement work focuses predominantly on issues related to new technologies in marketing (such as AI) and how both customers and businesses can benefit from new technologies.",
        "Academic Partner": "Oxford",
        "Faculty Code": "Professor (Tier 1)",
        "Preferred name": "Andrew Stephen",
        "Subject Area": "",
        "Note": ""
    }
]